# string lower

In [2]:
import pandas as pd
import numpy as np
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

# convert lowercase column use str.lower()
df['Courses'] = df['Courses'].str.lower()
print(df)

# convert lowercase column use apply()
df['Courses'] = df['Courses'].apply(str.lower)
print(df)

# Use apply() & lambda function
df['Courses'].apply(lambda x: x.lower())
print(df)

# Convert pandas column to lowercase use map()
df['Courses'] = df['Courses'].map(str.lower)
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400
   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400
   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400
   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400
   Courses    Fee Duration Discount
0    spark  22000   30days     1000
1  pyspark  25000   50days     2300
2   hadoop  24000   40days     2500
3   pandas  26000   60days     1400

# string upper()

In [2]:
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

# convert uppercase column use str.upper()
df['Duration'] = df['Duration'].str.upper()
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400
   Courses    Fee Duration Discount
0    SPARK  22000   30DAYS     1000
1  PYSPARK  25000   50DAYS     2300
2   HADOOP  24000   40DAYS     2500
3   PANDAS  26000   60DAYS     1400

# string length()

In [3]:
technologies= ({
    'Courses':["SPARK","PYSPARK","HADOOP","PANDAS"],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

# find length
df['length'] = df['Duration'].str.len()
print(df)

   Courses    Fee Duration Discount
0    SPARK  22000   30days     1000
1  PYSPARK  25000   50days     2300
2   HADOOP  24000   40days     2500
3   PANDAS  26000   60days     1400
   Courses    Fee Duration Discount  length
0    SPARK  22000   30days     1000       6
1  PYSPARK  25000   50days     2300       6
2   HADOOP  24000   40days     2500       6
3   PANDAS  26000   60days     1400       6

In [4]:
import pandas as pd

data = pd.DataFrame({

    'age' : [15, 17, 20, 14, 25],

    'name': ["Sample", "New User", "My Name", "Jane Doe", "John Doe"]

})

data['length']=data['name'].str.len()
data

   age      name  length
0   15    Sample       6
1   17  New User       8
2   20   My Name       7
3   14  Jane Doe       8
4   25  John Doe       8

# str.strip()

In [5]:
import numpy as np
import pandas as pd
s = pd.Series(['1. Bat.  ', '2. Dog!\n', '3. fox?\t', np.nan])
print(s.str.strip('1. Bat'))

0
1    2. Dog!\n
2    3. fox?\t
3          NaN
dtype: object

# str.lstrip()

In [6]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

# convert uppercase column use str.upper()
df['Duration'] = df['Duration'].str.lstrip()
print(df)
print(df['Courses'][0])

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400
     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400
 SPARK

In [7]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

# convert uppercase column use str.upper()
df['Duration'] = df['Duration'].str.rstrip()
print(df)
print(df['Courses'][0])

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400
     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400
 SPARK

# s.str.split()

In [8]:


import numpy as np
import pandas as pd
s = "one,two,three"
x=s.split(',')
x

['one', 'two', 'three']

# str.contains()

In [9]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

df['Courses'].str.contains('PA')

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400

0     True
1     True
2    False
3     True
Name: Courses, dtype: bool

# str.replace()

In [22]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)

df.replace(" SPARK ","NUMPY",inplace=True)
df

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400

     Courses    Fee Duration Discount
0      NUMPY  22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400

# str.startswith()

In [23]:
var = "Simran preet kaur"
 
print(var.startswith("Simran"))

True

# str.endswith()

In [25]:
var1="simran preet kaur"
print(var.endswith("kau"))

False

# str.cat()

In [26]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)
new = df['Duration'].copy()
df['Fee']=df['Fee'].str.cat(new,sep=",")
df

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400

     Courses           Fee Duration Discount
0     SPARK   22000,30days   30days     1000
1   PYSPARK   25000,50days   50days     2300
2    HADOOP   24000,40days   40days     2500
3    PANDAS   26000,60days   60days     1400

# str.get()

In [17]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)
df['Courses'].str.get(2)

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400

0    P
1    Y
2    A
3    A
Name: Courses, dtype: object

# str.slice()

In [18]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)
df["Courses"].str.slice(2,-2,2)

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400

0     PR
1    YPR
2     AO
3     AD
Name: Courses, dtype: object

# str.find()

In [20]:
technologies= ({
    'Courses':[" SPARK "," PYSPARK "," HADOOP "," PANDAS "],
    'Fee' :['22000','25000','24000','26000'],
    'Duration':['30days','50days','40days','60days'],
    'Discount':['1000','2300','2500','1400']
              })
df = pd.DataFrame(technologies)
print(df)
string = " hello world is the first code of every programmer"
print(string.find("world"))

     Courses    Fee Duration Discount
0     SPARK   22000   30days     1000
1   PYSPARK   25000   50days     2300
2    HADOOP   24000   40days     2500
3    PANDAS   26000   60days     1400
7